NetologySlow/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

NetologySlow/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

NetologySlow/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)   
	
	МассивОшибок=Новый Массив; 
	Если  Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда  
		Если СтрДлина(Объект.ИНН)<>10 Тогда  
			МассивОшибок.Добавить("Длина ИНН Юридического лица должна содержать 10 цифр!");
			ИначеЕсли  СтрДлина (Объект.ИНН) =10 тогда
	        Если не ИННВерен(Объект.ИНН)Тогда   
	        МассивОшибок.Добавить("ИНН не корректен");  
			КонецЕсли;
         КонецЕсли; 
     
	     Если СтрДлина(Объект.КПП)<9 Тогда   
		    МассивОшибок.Добавить("Длина КПП Юридического лица должна содержать 9 цифр!"); 
		 КонецЕсли;
     КонецЕсли;    

     Если  Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда 
		 Если СтрДлина(Объект.ИНН)<12 Тогда 
		    МассивОшибок.Добавить("Длина ИНН Физического лица должна содержать 12 цифр!");
		 ИначеЕсли  СтрДлина (Объект.ИНН) =12 тогда
              Если не ИННВерен(Объект.ИНН)Тогда
		      МассивОшибок.Добавить("ИНН не корректен");
              КонецЕсли;
         КонецЕсли; 
	 КонецЕсли;  
	 
	 Если ЗначениеЗаполнено (МассивОшибок) Тогда
		 Отказ=Истина; 
		 ТекстОшибок=СтрСоединить(МассивОшибок, Символы.ПС);
		 ПоказатьПредупреждение(, ТекстОшибок);   
	 КонецЕсли; 
	 		 
КонецПроцедуры     

&НаКлиентеНаСервереБезКонтекста
Функция  ИННВерен(Знач ИНН)Экспорт  
	
	МассивМножителейКонтрольнойСуммы=СтрРазделить("3,7,2,4,10,3,5,9,4,6,8,0",",", Ложь);
	КонтрольнаяСумма=0;    
	КонтрольнаяСуммаФизЛица=0; 
	ВтораяКонтрольнаяСуммаФизЛица=0;
	
	Если СтрДлина(ИНН)=10 Тогда  //Проверка для ИНН Юрлица
    	Для Сч=1 по 9 Цикл
		ЗначениеРазряда=Число(Сред(ИНН, сч, 1));
		КонтрольнаяСумма=КонтрольнаяСумма+(ЗначениеРазряда  * МассивМножителейКонтрольнойСуммы[Сч+1]);  
	    КонецЦикла;   
	    КонтрольныйРазряд=(КонтрольнаяСумма%11)%10;
	    Если Число(Сред(ИНН,10,1))=КонтрольныйРазряд Тогда
        Возврат Истина; 
	    Иначе
		Возврат Ложь;
		КонецЕсли;
    КонецЕсли;
	
	Если СтрДлина(ИНН)=12 Тогда  //Проверка для ИНН Физлица    
	    Для Сч=1 по 11 Цикл
		ЗначениеРазряда=Число(Сред(ИНН, сч, 1));
		КонтрольнаяСуммаФизЛица=КонтрольнаяСуммаФизЛица+(ЗначениеРазряда  * МассивМножителейКонтрольнойСуммы[Сч]);   
		ВтораяКонтрольнаяСуммаФизЛица=ВтораяКонтрольнаяСуммаФизЛица+(ЗначениеРазряда  * МассивМножителейКонтрольнойСуммы[Сч-1]);
	    КонецЦикла;   
	    КонтрольныйРазрядФизЛица=(КонтрольнаяСуммаФизЛица%11)%10;  
	    ВторойКонтрольныйРазрядФизЛица=(ВтораяКонтрольнаяСуммаФизЛица%11)%10;
	        Если Число(Сред(ИНН,11,1))=КонтрольныйРазрядФизЛица И Число(Сред(ИНН,12,1))=ВторойКонтрольныйРазрядФизЛица Тогда
	        Возврат Истина; 
		    Иначе
			Возврат Ложь;
	        КонецЕсли; 
	КонецЕсли; 
      
КонецФункции   

//ИНН для проверки Юр: 9393472071, Физ: 710607880087  

&НаКлиенте
Процедура ИННПриИзменении(Элемент)    
	
	Если  Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда  
		Если ЗначениеЗаполнено(Объект.ИНН) И СтрДлина(Объект.ИНН)<>10 Тогда   
			Элементы.ИНН.ЦветФона=WebЦвета.Красный;
			Сообщение=Новый СообщениеПользователю;
			Сообщение.Текст="ИНН юридического лица должен содержать 10 цифр!";
			Сообщение.ПутьКДанным="Объект";
			Сообщение.Поле="ИНН";
			Сообщение.Сообщить();
        Иначе 
			Элементы.ИНН.ЦветФона=WebЦвета.Белый;
		    Сообщение=Новый СообщениеПользователю;
	        Сообщение.ПутьКДанным="Объект";
		    Сообщение.Поле="ИНН";
		КонецЕсли;  
     КонецЕсли; 
	 	
	 Если  Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда 
		 Если ЗначениеЗаполнено (Объект.ИНН) и СтрДлина(Объект.ИНН)<12 Тогда 
		 Элементы.ИНН.ЦветФона=WebЦвета.Красный;
		 Сообщение=Новый СообщениеПользователю;
		 Сообщение.Текст="ИНН физического лица должен содержать 12 цифр!";
		 Сообщение.ПутьКДанным="Объект";
		 Сообщение.Поле="КПП";
		 Сообщение.Сообщить();  
	     Иначе   
		 Элементы.ИНН.ЦветФона=WebЦвета.Белый;
		 Сообщение=Новый СообщениеПользователю;
	  	 Сообщение.ПутьКДанным="Объект";
		 Сообщение.Поле="ИНН";  
		 КонецЕсли;
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	Если  Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда 
		 Если ЗначениеЗаполнено(Объект.КПП) И СтрДлина(Объект.КПП)<9 Тогда   
		 Элементы.КПП.ЦветФона=WebЦвета.Красный;
		 Сообщение=Новый СообщениеПользователю;
		 Сообщение.Текст="КПП юридического лица должен содержать 9 цифр!";
		 Сообщение.ПутьКДанным="Объект";
		 Сообщение.Поле="КПП";
		 Сообщение.Сообщить();
	     Иначе
		 Элементы.КПП.ЦветФона=WebЦвета.Белый;
		 Сообщение=Новый СообщениеПользователю;
	     Сообщение.ПутьКДанным="Объект";
		 Сообщение.Поле="КПП"; 
		 КонецЕсли;
	 КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
    Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
        Элементы.КПП.Видимость = Истина;
    ИначеЕсли
        Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
            Элементы.КПП.Видимость = Ложь;     
			Объект.КПП="";
    КонецЕсли;	
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
	    Элементы.КПП.Видимость = Истина;
	ИначеЕсли
	    Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
	        Элементы.КПП.Видимость = Ложь;    
			Объект.КПП=""; 
		КонецЕсли;   
		
	//Сравнение заполненного в ПН с Наименованием    
		Если РасшифровкаОПФ()=ТекущийОбъект.ПолноеНаименование Тогда
		ПолноеНаименованиеМожноМенятьАвтоматически=Истина;
	    КонецЕсли;      
		
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)  
	  
	Если Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
	Объект.ПолноеНаименование=РасшифровкаОПФ();
	Иначе
	Если ПолноеНаименованиеМожноМенятьАвтоматически=Истина Тогда   
	Объект.ПолноеНаименование=РасшифровкаОПФ();
	КонецЕсли; 
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Функция  РасшифровкаОПФ()Экспорт     //Из наименования получаем расшифрованное значение
    СоответствиеОПФ_Расшифровка=Новый Соответствие; 
    СоответствиеОПФ_Расшифровка.Вставить("АО", "Акционерное общество"); 
	СоответствиеОПФ_Расшифровка.Вставить("ЗАО", "Закрытое акционерное общество"); 
	СоответствиеОПФ_Расшифровка.Вставить("ООО", "Общество с ограниченной ответственностью");
	СоответствиеОПФ_Расшифровка.Вставить("ИП", "Индивидуальный предприниматель");   
	СоответствиеОПФ_Расшифровка.Вставить("ПР", "Проверка"); 

	
    СловаНаименования=СтрРазделить(Объект.Наименование, " ");	
	ПолноеНаименованиеМассив=Новый Массив; 
	
	Для Каждого Слово из СловаНаименования Цикл  
		Расшифровка=СоответствиеОПФ_Расшифровка.Получить(ВРег(Слово));					
		Если Расшифровка=Неопределено Тогда
			 ПолноеНаименованиеМассив.Добавить(Слово);  
		 Иначе
			 ПолноеНаименованиеМассив.Добавить(Расшифровка); 
		КонецЕсли;
	КонецЦикла;	 
	
	РасшифрованноеЗначение=СтрСоединить(ПолноеНаименованиеМассив, " ");     
	
	Возврат РасшифрованноеЗначение; 
КонецФункции   

//&НаКлиенте
//Процедура ПолноеНаименованиеПриИзменении(Элемент) 
//	
//	ВремПерем=Объект.ПолноеНаименование;

//	Если ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда   
//		Если ПолноеНаименованиеМожноМенятьАвтоматически=Истина Тогда   
//	    Объект.ПолноеНаименование=РасшифровкаОПФ(); 
//	    Иначе
//		Объект.ПолноеНаименование=ВремПерем; 
//        КонецЕсли;
//    КонецЕсли; 	
//КонецПроцедуры
